#Раскоментируйте импорт для корректной работы программы.

#zadanie_1_2 - Асинхронная функция для отображения времени в бесконечном цикле
#zadanie_3_4 - Асинхронные запросы к веб-серверу и базе данных
#zadanie_5_6 - Асинхронный веб-скрапер
#zadanie_7 -  Cервер и клиент для отправки текстовых сообщений

#import zadanie_1_2 #Примечание: При запуске кода могут возникнуть проблемы с библиотекой keyboard, Repl.it не всегда может ее импортировать. В VS-code программа работает без проблем.

#import zadanie_3_4

#import zadanie_5_6

# Для запуска задания 7 нужно выполнить следующие шаги:
# Откройте 2 окна Shell
# В первом Shell окне вызовите команду: python zadanie_7_server.py
# Во втором Shell окне вызовите команду: python zadanie_7_client.py
# Отправляйте сообщения серверу